Revit 2022 API
FabricationNetworkChangeService.SetGroupId Method
 This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `SetPaletteId` method instead.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2018.2
Syntax
C#
[ObsoleteAttribute]
public void SetGroupId(
	int groupId
)
Visual Basic
<ObsoleteAttribute> _
Public Sub SetGroupId ( _
	groupId As Integer _
)
Visual C++
[ObsoleteAttribute]
public:
void SetGroupId(
	int groupId
)
Parameters
groupId
Type: System.Int32
See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace